
num = 1
let Num
let a = document.getElementById("button-no");
let b = document.getElementById("button-yes");
console.log(a)
let h1 = document.querySelector("h1")
let p = document.querySelector("p")
function nany() {
    let Num =num++
    console.log(Num)

    if (g1 =(Num==1)){
        // คำสั่งทำให้ปุ่มใหญ่ขึ้นละเปลี่ยนคำ ส่วนของเปลี่ยนคำน่าจะเปลี่ยนคลาสเอาเพราะรู้แค่นี้
        a.innerText="กดทำควยไร";

    }
    if (g1 =(Num==2)){
        // คำสั่งทำให้ปุ่มใหญ่ขึ้นละเปลี่ยนคำ ส่วนของเปลี่ยนคำน่าจะเปลี่ยนคลาสเอาเพราะรู้แค่นี้
        a.innerText="กดหาโครตพ่อโครตแม่มึงอะ";
    }
    if (g1 =(Num==3)){
        // คำสั่งทำให้ปุ่มใหญ่ขึ้นละเปลี่ยนคำ ส่วนของเปลี่ยนคำน่าจะเปลี่ยนคลาสเอาเพราะรู้แค่นี้
        a.innerText="ไอ่สัสอย่ามึน";
    }
    if (g1 =(Num==4)){
        // คำสั่งทำให้ปุ่มใหญ่ขึ้นละเปลี่ยนคำ ส่วนของเปลี่ยนคำน่าจะเปลี่ยนคลาสเอาเพราะรู้แค่นี้
        a.innerText="โอ้น้อยใจวะตามสบายเลย";
    }
    if (g1 =(Num==5)){
        // คำสั่งทำให้ปุ่มใหญ่ขึ้นละเปลี่ยนคำ ส่วนของเปลี่ยนคำน่าจะเปลี่ยนคลาสเอาเพราะรู้แค่นี้
        a.innerText="ถ้ากดอีกเลิกคุยก๊ะกูเลย";
    }
    if (g1 =(Num==6)){
        // คำสั่งทำให้ปุ่มใหญ่ขึ้นละเปลี่ยนคำ ส่วนของเปลี่ยนคำน่าจะเปลี่ยนคลาสเอาเพราะรู้แค่นี้
        a.innerText="ถ้ากดอีกเลิกคุยก๊ะกูเลย";
     
    }
    if (g1 =(Num==7)){
        // คำสั่งทำให้ปุ่มใหญ่ขึ้นละเปลี่ยนคำ ส่วนของเปลี่ยนคำน่าจะเปลี่ยนคลาสเอาเพราะรู้แค่นี้
        a.classList.remove("bg-red-500");
        a.classList.remove("hover:bg-red-700");
        a.innerText="yes";
        p.innerText="อย่ามึนไอ่สัสกูไม่ให้กดละ";
    }
}

function nanyes() {
    h1.innerText="ยินดีด้วยครับคุณได้หัวใจผมไปครอบครอง";
    p.innerText="น่ารักมากคั้บbaby ใจๆๆ";
}






